## ----------------------------------------
## Brewfile
##
## sort command: %g/## ====/+1,/^$/-1 sort
## ----------------------------------------

tap "homebrew/bundle"
tap "1password/tap"
tap "ngrok/ngrok"

cask_args appdir: "/Applications"

## ========== Common ==========
brew "watchman"

## ========== Terminal / Shell ===========
cask "wezterm@nightly"

## ========== Fonts ==========
cask "font-fira-code-nerd-font"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "font-monaspace"
cask "font-moralerspace"

## ========= Utility ==========
brew "media-control"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "alt-tab"
cask "deepl"
cask "deskpad"
cask "google-japanese-ime"
cask "karabiner-elements"
cask "keycastr"
cask "logi-options+"
cask "mac-mouse-fix"
cask "monitorcontrol"
cask "obsidian"
cask "raycast"
cask "setapp"

## ========= Browser ==========
cask "arc"
cask "firefox"
cask "google-chrome"

## ======= Development ========
cask "android-platform-tools"
cask "android-studio"
cask "claude"
cask "claude-code"
cask "figma"
cask "google-cloud-sdk"

### ---------- Lang -----------
brew "tfenv"

### ------- IDE/Editor --------
cask "intellij-idea"
cask "visual-studio-code"

### ------- Other Apps --------
cask "chatgpt"
cask "ngrok"
cask "postman"

## ======== Quick Look ========
cask "apparency"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "quicklookase"
cask "suspicious-package"

## ========= Others ==========

# App store
mas "Display Menu", id: 549083868
mas "Hidden Bar", id: 1452453066
mas "Klack", id: 6446206067
mas "Xcode", id: 497799835
