## ----------------------------------------
## Brewfile
##
## sort command: %g/## ====/+1,/^$/-1 sort
## ----------------------------------------

tap "homebrew/bundle"
tap "1password/tap"
tap "ngrok/ngrok"

cask_args appdir: "/Applications"

## ========== Common ==========
brew "autozimu/formulas/unison-fsmonitor"
brew "bat"
brew "chafa"
brew "cloc"
brew "coreutils"
brew "daipeihust/tap/im-select"
brew "direnv"
brew "fzf"
brew "fd"
brew "gnu-sed"
brew "imagemagick"
brew "jq"
brew "lsd"
brew "nkf"
brew "ripgrep"
brew "sd"
brew "tree"
brew "unison"
brew "watchman"
brew "wget"
brew "yazi"
brew "yq"
brew "zoxide"

## ========== Terminal / Shell ===========
brew "chezmoi"
brew "sheldon"
brew "starship"
brew "terminal-notifier"
brew "tmux"
brew "zellij"
brew "zsh-completions"
cask "wezterm@nightly"

## ========== Fonts ==========
cask "font-fira-code-nerd-font"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "font-monaspace"
cask "font-moralerspace"

## ========= Utility ==========
brew "laishulu/homebrew/macism"
brew "mac-mouse-fix"
brew "media-contro"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "alt-tab"
cask "deepl"
cask "deskpad"
cask "google-japanese-ime"
cask "karabiner-elements"
cask "keycastr"
cask "logi-options+"
cask "monitorcontrol"
cask "obsidian"
cask "raycast"
cask "setapp"
cask "mac-mouse-fix"

## ========= Browser ==========
cask "arc"
cask "firefox"
cask "google-chrome"

## ======= Development ========
brew "ast-grep"
brew "cocoapods"
brew "diff-so-fancy"
brew "docker"
brew "fzf-make"
brew "gh"
brew "ghq"
brew "git"
brew "gibo"
brew "git-delta"
brew "infracost"
brew "lazygit"
brew "oxker"
brew "pre-commit"
brew "uv"
brew "trivy"
cask "android-platform-tools"
cask "android-studio"
cask "figma"
cask "google-cloud-sdk"
cask "claude-code"
cask "claude"

### ---------- Lang -----------
brew "mise"
brew "openjdk"
brew "php"
brew "python"
brew "rust"
brew "rustup"
brew "sbt"
brew "terraform-docs"
brew "tfenv"
brew "tflint"
brew "hashicorp/tap/terraform-ls"

### ------- IDE/Editor --------
brew "neovim"
brew "neovim-remote"
cask "intellij-idea"
cask "visual-studio-code"

### ------- Other Apps --------
cask "chatgpt"
cask "ngrok"
cask "postman"
brew "hugo"

## ======== Quick Look ========
cask "apparency"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "quicklookase"
cask "suspicious-package"

## ========= Others ==========
brew "cmatrix"
brew "fastfetch"
brew "nyancat"
brew "sl"

# App store
brew "mas"
mas "Display Menu", id: 549083868
mas "Hidden Bar", id: 1452453066
mas "Klack", id: 6446206067
mas "Xcode", id: 497799835
