tap "1password/tap"
tap "adoptopenjdk/openjdk"
tap "fumiyas/echo-sd"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "openresty/brew"
brew "anyenv"
brew "apr-util"
brew "bat"
brew "boost"
brew "glib"
brew "python@3.9"
brew "coreutils"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "cask"
brew "ruby"
brew "cocoapods"
brew "openldap"
brew "curl"
brew "deno"
brew "diff-so-fancy"
brew "direnv"
brew "docker"
brew "folly"
brew "exa"
brew "exiftool"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "fish"
brew "harfbuzz"
brew "pango"
brew "fontforge"
brew "freetds"
brew "fzf"
brew "gh"
brew "ghostscript"
brew "ghq"
brew "gibo"
brew "git"
brew "gnu-sed"
brew "python@3.10"
brew "gobject-introspection"
brew "libheif"
brew "imagemagick"
brew "jq"
brew "krb5"
brew "lazygit"
brew "libfido2"
brew "libpq"
brew "mas"
brew "mysql"
brew "neovim"
brew "nginx"
brew "openjdk"
brew "php"
brew "ripgrep"
brew "rust"
brew "rustup-init"
brew "sbt"
brew "sl"
brew "starship"
brew "terminal-notifier"
brew "terraform"
brew "tree"
brew "watchman"
brew "wget"
brew "yq"
brew "fumiyas/echo-sd/echo-sd"
brew "openresty/brew/openresty"
cask "1password", args: { appdir: "/Applications" }
cask "1password-cli"
cask "adoptopenjdk15", args: { appdir: "/Applications" }
cask "adoptopenjdk8", args: { appdir: "/Applications" }
cask "alfred", args: { appdir: "/Applications" }
cask "alt-tab", args: { appdir: "/Applications" }
cask "android-platform-tools", args: { appdir: "/Applications" }
cask "android-sdk", args: { appdir: "/Applications" }
cask "android-studio", args: { appdir: "/Applications" }
cask "apparency", args: { appdir: "/Applications" }
cask "cleanshot"
cask "deepl", args: { appdir: "/Applications" }
cask "firefox", args: { appdir: "/Applications" }
cask "flipper"
cask "font-cica"
cask "font-fira-code-nerd-font", args: { appdir: "/Applications" }
cask "font-hackgen", args: { appdir: "/Applications" }
cask "font-hackgen-nerd", args: { appdir: "/Applications" }
cask "fuwari", args: { appdir: "/Applications" }
cask "google-chrome", args: { appdir: "/Applications" }
cask "google-cloud-sdk", args: { appdir: "/Applications" }
cask "intellij-idea", args: { appdir: "/Applications" }
cask "iterm2", args: { appdir: "/Applications" }
cask "itsycal"
cask "kap"
cask "karabiner-elements", args: { appdir: "/Applications" }
cask "keycastr", args: { appdir: "/Applications" }
cask "krisp"
cask "logitech-options"
cask "monitorcontrol", args: { appdir: "/Applications" }
cask "postman", args: { appdir: "/Applications" }
cask "pushplaylabs-sidekick"
cask "qlcolorcode", args: { appdir: "/Applications" }
cask "qlimagesize", args: { appdir: "/Applications" }
cask "qlmarkdown", args: { appdir: "/Applications" }
cask "qlstephen", args: { appdir: "/Applications" }
cask "qlvideo", args: { appdir: "/Applications" }
cask "quicklook-json", args: { appdir: "/Applications" }
cask "quicklookase", args: { appdir: "/Applications" }
cask "raycast"
cask "skitch", args: { appdir: "/Applications" }
cask "slack"
cask "sound-control"
cask "suspicious-package", args: { appdir: "/Applications" }
cask "visual-studio-code", args: { appdir: "/Applications" }
cask "wezterm"
mas "Display Menu", id: 549083868
mas "Gestimer", id: 990588172
mas "Hidden Bar", id: 1452453066
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "RetroClip", id: 1332064978
mas "TinyTranslate", id: 1616724873
mas "Xcode", id: 497799835
